### Terraform Plan Results - `prod` 🚀

#### Environment: `prod`
#### Terraform Initialization ⚙️ `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.main[0] will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "log-hubspoke-prod-uks"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-hubspoke-prod-uks-hub"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # azurerm_resource_group.dev will be created
  + resource "azurerm_resource_group" "dev" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-hubspoke-prod-uks-dev"
      + tags     = (known after apply)
    }

  # azurerm_resource_group.hub will be created
  + resource "azurerm_resource_group" "hub" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-hubspoke-prod-uks-hub"
      + tags     = (known after apply)
    }

  # azurerm_resource_group.prod will be created
  + resource "azurerm_resource_group" "prod" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-hubspoke-prod-uks-prod"
      + tags     = (known after apply)
    }

  # azurerm_resource_group.shared will be created
  + resource "azurerm_resource_group" "shared" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-hubspoke-prod-uks-shared"
      + tags     = (known after apply)
    }

  # azurerm_route.dev_to_internet will be created
  + resource "azurerm_route" "dev_to_internet" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "route-dev-to-internet"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-hubspoke-prod-uks-dev"
      + route_table_name       = "rt-dev"
    }

  # azurerm_route.prod_to_internet will be created
  + resource "azurerm_route" "prod_to_internet" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "route-prod-to-internet"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-hubspoke-prod-uks-prod"
      + route_table_name       = "rt-prod"
    }

  # azurerm_route.shared_to_internet will be created
  + resource "azurerm_route" "shared_to_internet" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "route-shared-to-internet"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-hubspoke-prod-uks-shared"
      + route_table_name       = "rt-shared"
    }

  # module.aks_dev.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.aks_dev.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "stable"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "aks-hubspoke-prod-uks-dev-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.33"
      + location                            = "uksouth"
      + name                                = "aks-hubspoke-prod-uks-dev"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-hubspoke-prod-uks-dev"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = (known after apply)
      + workload_identity_enabled           = false

      + azure_active_directory_role_based_access_control {
          + azure_rbac_enabled = true
          + managed            = true
          + tenant_id          = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 2
          + name                 = "system"
          + node_count           = 1
          + node_labels          = {
              + "environment"   = "dev"
              + "nodepool-type" = "system"
              + "nodepoolos"    = "linux"
            }
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 128
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + tags                 = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2s_v3"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
          + zones                = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + maintenance_window_auto_upgrade {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = (known after apply)
          + start_time  = "00:00"
        }

      + network_profile {
          + dns_service_ip          = "172.16.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "172.16.0.0/16"
          + service_cidrs           = (known after apply)
        }
    }

  # module.aks_prod.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.aks_prod.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "patch"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "aks-hubspoke-prod-uks-prod-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.33"
      + location                            = "uksouth"
      + name                                = "aks-hubspoke-prod-uks-prod"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-hubspoke-prod-uks-prod"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = (known after apply)
      + workload_identity_enabled           = false

      + azure_active_directory_role_based_access_control {
          + azure_rbac_enabled = true
          + managed            = true
          + tenant_id          = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 2
          + name                 = "system"
          + node_count           = 2
          + node_labels          = {
              + "environment"   = "prod"
              + "nodepool-type" = "system"
              + "nodepoolos"    = "linux"
            }
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 128
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + tags                 = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D4s_v3"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
          + zones                = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + maintenance_window_auto_upgrade {
          + day_of_week = "Sunday"
          + duration    = 4
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = (known after apply)
          + start_time  = "00:00"
        }

      + network_profile {
          + dns_service_ip          = "172.16.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "172.16.0.0/16"
          + service_cidrs           = (known after apply)
        }
    }

  # module.firewall.azurerm_firewall.main will be created
  + resource "azurerm_firewall" "main" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "afw-hubspoke-prod-uks"
      + resource_group_name = "rg-hubspoke-prod-uks-hub"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + tags                = (known after apply)
      + threat_intel_mode   = (known after apply)

      + ip_configuration {
          + name                 = "fw-ipconfig"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }

      + management_ip_configuration {
          + name                 = "fw-mgmt-ipconfig"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.firewall.azurerm_firewall_policy.main will be created
  + resource "azurerm_firewall_policy" "main" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "afwp-hubspoke-prod-uks"
      + resource_group_name      = "rg-hubspoke-prod-uks-hub"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + tags                     = (known after apply)
      + threat_intelligence_mode = "Alert"

      + dns {
          + proxy_enabled = true
        }
    }

  # module.firewall.azurerm_firewall_policy_rule_collection_group.main will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "main" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "DefaultRuleCollectionGroup"
      + priority           = 100

      + application_rule_collection {
          + action   = "Allow"
          + name     = "ApplicationRuleCollection"
          + priority = 200

          + rule {
              + destination_fqdns = [
                  + "*.azmk8s.io",
                  + "*.blob.core.windows.net",
                  + "*.cdn.mscr.io",
                  + "mcr.microsoft.com",
                  + "*.data.mcr.microsoft.com",
                  + "management.azure.com",
                  + "login.microsoftonline.com",
                  + "packages.microsoft.com",
                  + "acs-mirror.azureedge.net",
                  + "dc.services.visualstudio.com",
                  + "*.ods.opinsights.azure.com",
                  + "*.oms.opinsights.azure.com",
                  + "*.monitoring.azure.com",
                ]
              + name              = "AllowAKSRequiredFQDNs"
              + source_addresses  = [
                  + "10.1.0.0/16",
                  + "10.2.0.0/16",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
              + protocols {
                  + port = 80
                  + type = "Http"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "security.ubuntu.com",
                  + "azure.archive.ubuntu.com",
                  + "changelogs.ubuntu.com",
                ]
              + name              = "AllowUbuntuUpdates"
              + source_addresses  = [
                  + "10.1.0.0/16",
                  + "10.2.0.0/16",
                ]

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "*.docker.io",
                  + "*.docker.com",
                  + "production.cloudflare.docker.com",
                ]
              + name              = "AllowDockerHub"
              + source_addresses  = [
                  + "10.1.0.0/16",
                  + "10.2.0.0/16",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "github.com",
                  + "*.github.com",
                  + "*.githubusercontent.com",
                ]
              + name              = "AllowGitHub"
              + source_addresses  = [
                  + "10.1.0.0/16",
                  + "10.2.0.0/16",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

      + network_rule_collection {
          + action   = "Allow"
          + name     = "NetworkRuleCollection"
          + priority = 100

          + rule {
              + destination_addresses = [
                  + "AzureCloud",
                ]
              + destination_ports     = [
                  + "443",
                  + "80",
                ]
              + name                  = "AllowAzureServices"
              + protocols             = [
                  + "TCP",
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                  + "10.2.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "53",
                ]
              + name                  = "AllowDNS"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.0.0.0/8",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "123",
                ]
              + name                  = "AllowNTP"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.0.0.0/8",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "10.3.0.0/16",
                ]
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "AllowAKStoACR"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                  + "10.2.0.0/16",
                ]
            }
        }
    }

  # module.firewall.azurerm_monitor_diagnostic_setting.firewall[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "firewall" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "diag-afw-hubspoke-prod-uks"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AzureFirewallApplicationRule"
        }
      + enabled_log {
          + category = "AzureFirewallDnsProxy"
        }
      + enabled_log {
          + category = "AzureFirewallNetworkRule"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.firewall.azurerm_public_ip.firewall will be created
  + resource "azurerm_public_ip" "firewall" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "pip-hubspoke-prod-uks-afw"
      + resource_group_name     = "rg-hubspoke-prod-uks-hub"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = (known after apply)
    }

  # module.firewall.azurerm_public_ip.firewall_management will be created
  + resource "azurerm_public_ip" "firewall_management" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "pip-hubspoke-prod-uks-afw-mgmt"
      + resource_group_name     = "rg-hubspoke-prod-uks-hub"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = (known after apply)
    }

  # module.networking.azurerm_network_security_group.dev_aks will be created
  + resource "azurerm_network_security_group" "dev_aks" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "nsg-aks-dev"
      + resource_group_name = "rg-hubspoke-prod-uks-dev"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.networking.azurerm_network_security_group.prod_aks will be created
  + resource "azurerm_network_security_group" "prod_aks" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "nsg-aks-prod"
      + resource_group_name = "rg-hubspoke-prod-uks-prod"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.networking.azurerm_network_security_rule.dev_aks_internal will be created
  + resource "azurerm_network_security_rule" "dev_aks_internal" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.1.0.0/20"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowAKSInternal"
      + network_security_group_name = "nsg-aks-dev"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-hubspoke-prod-uks-dev"
      + source_address_prefix       = "10.1.0.0/20"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.prod_aks_internal will be created
  + resource "azurerm_network_security_rule" "prod_aks_internal" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.2.0.0/20"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowAKSInternal"
      + network_security_group_name = "nsg-aks-prod"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-hubspoke-prod-uks-prod"
      + source_address_prefix       = "10.2.0.0/20"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_route_table.dev will be created
  + resource "azurerm_route_table" "dev" {
      + bgp_route_propagation_enabled = true
      + disable_bgp_route_propagation = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rt-dev"
      + resource_group_name           = "rg-hubspoke-prod-uks-dev"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = (known after apply)
    }

  # module.networking.azurerm_route_table.prod will be created
  + resource "azurerm_route_table" "prod" {
      + bgp_route_propagation_enabled = true
      + disable_bgp_route_propagation = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rt-prod"
      + resource_group_name           = "rg-hubspoke-prod-uks-prod"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = (known after apply)
    }

  # module.networking.azurerm_route_table.shared will be created
  + resource "azurerm_route_table" "shared" {
      + bgp_route_propagation_enabled = true
      + disable_bgp_route_propagation = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "rt-shared"
      + resource_group_name           = "rg-hubspoke-prod-uks-shared"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = (known after apply)
    }

  # module.networking.azurerm_subnet.dev_aks will be created
  + resource "azurerm_subnet" "dev_aks" {
      + address_prefixes                               = [
          + "10.1.0.0/20",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-aks-dev"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-dev"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-dev"
    }

  # module.networking.azurerm_subnet.dev_private_endpoint will be created
  + resource "azurerm_subnet" "dev_private_endpoint" {
      + address_prefixes                               = [
          + "10.1.16.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-pe-dev"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-dev"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-dev"
    }

  # module.networking.azurerm_subnet.firewall will be created
  + resource "azurerm_subnet" "firewall" {
      + address_prefixes                               = [
          + "10.0.0.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-hub"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-hub"
    }

  # module.networking.azurerm_subnet.firewall_management will be created
  + resource "azurerm_subnet" "firewall_management" {
      + address_prefixes                               = [
          + "10.0.0.64/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallManagementSubnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-hub"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-hub"
    }

  # module.networking.azurerm_subnet.gateway will be created
  + resource "azurerm_subnet" "gateway" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "GatewaySubnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-hub"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-hub"
    }

  # module.networking.azurerm_subnet.prod_aks will be created
  + resource "azurerm_subnet" "prod_aks" {
      + address_prefixes                               = [
          + "10.2.0.0/20",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-aks-prod"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-prod"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-prod"
    }

  # module.networking.azurerm_subnet.prod_private_endpoint will be created
  + resource "azurerm_subnet" "prod_private_endpoint" {
      + address_prefixes                               = [
          + "10.2.16.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-pe-prod"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-prod"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-prod"
    }

  # module.networking.azurerm_subnet.shared_private_endpoint will be created
  + resource "azurerm_subnet" "shared_private_endpoint" {
      + address_prefixes                               = [
          + "10.3.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-pe-shared"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-shared"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-shared"
    }

  # module.networking.azurerm_subnet.shared_services will be created
  + resource "azurerm_subnet" "shared_services" {
      + address_prefixes                               = [
          + "10.3.0.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-services-shared"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-hubspoke-prod-uks-shared"
      + virtual_network_name                           = "vnet-hubspoke-prod-uks-shared"
    }

  # module.networking.azurerm_subnet_network_security_group_association.dev_aks will be created
  + resource "azurerm_subnet_network_security_group_association" "dev_aks" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.networking.azurerm_subnet_network_security_group_association.prod_aks will be created
  + resource "azurerm_subnet_network_security_group_association" "prod_aks" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.networking.azurerm_subnet_route_table_association.dev_aks will be created
  + resource "azurerm_subnet_route_table_association" "dev_aks" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.azurerm_subnet_route_table_association.prod_aks will be created
  + resource "azurerm_subnet_route_table_association" "prod_aks" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.azurerm_subnet_route_table_association.shared_services will be created
  + resource "azurerm_subnet_route_table_association" "shared_services" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.azurerm_virtual_network.dev will be created
  + resource "azurerm_virtual_network" "dev" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "vnet-hubspoke-prod-uks-dev"
      + resource_group_name = "rg-hubspoke-prod-uks-dev"
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # module.networking.azurerm_virtual_network.hub will be created
  + resource "azurerm_virtual_network" "hub" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "vnet-hubspoke-prod-uks-hub"
      + resource_group_name = "rg-hubspoke-prod-uks-hub"
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # module.networking.azurerm_virtual_network.prod will be created
  + resource "azurerm_virtual_network" "prod" {
      + address_space       = [
          + "10.2.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "vnet-hubspoke-prod-uks-prod"
      + resource_group_name = "rg-hubspoke-prod-uks-prod"
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # module.networking.azurerm_virtual_network.shared will be created
  + resource "azurerm_virtual_network" "shared" {
      + address_space       = [
          + "10.3.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "vnet-hubspoke-prod-uks-shared"
      + resource_group_name = "rg-hubspoke-prod-uks-shared"
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # module.networking.azurerm_virtual_network_peering.dev_to_hub will be created
  + resource "azurerm_virtual_network_peering" "dev_to_hub" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "peer-dev-to-hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-hubspoke-prod-uks-dev"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-hubspoke-prod-uks-dev"
    }

  # module.networking.azurerm_virtual_network_peering.hub_to_dev will be created
  + resource "azurerm_virtual_network_peering" "hub_to_dev" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "peer-hub-to-dev"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-hubspoke-prod-uks-hub"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-hubspoke-prod-uks-hub"
    }

  # module.networking.azurerm_virtual_network_peering.hub_to_prod will be created
  + resource "azurerm_virtual_network_peering" "hub_to_prod" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "peer-hub-to-prod"
```

</details>

**Pusher:** @orisaya
**Action:** pull_request
**Working Directory:** `.`

*Plan generated on: Thu, 04 Dec 2025 20:31:03 GMT*
